## Visualizations of database USAD

First, we install the libraries we're going to use:

In [1]:
!pip install SQLAlchemy 
!pip install psycopg2-binary

Requirement already satisfied: SQLAlchemy in /opt/conda/lib/python3.9/site-packages (1.4.27)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.9/site-packages (from SQLAlchemy) (1.1.2)
Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.2-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.0 MB)
     |████████████████████████████████| 3.0 MB 1.6 MB/s
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.2

And we import them:

In [13]:
import psycopg2 as pg
import pandas as pd
import matplotlib
import seaborn as sns

We connect to the database:

In [3]:
conn = pg.connect(host='postgres', database='postgres', user='postgres', password='postgres')

### Visualizations:

First Visualization: **Number of publications for each journal**

In [35]:
v_1 = pd.read_sql("SELECT journal, COUNT(journal) as number_of_publications FROM data_src GROUP BY journal", conn)

In [65]:
v_1 #Data for visualization 1

                                              journal  number_of_publications
0                                         J Food Qual                       1
1          Journal  of Agriculture and Food Chemistry                       1
2                                     J Agr Food Chem                       4
3                          Z. Lebensm Unters Forsch A                       1
4   Food and Drug Bulletin No. 134, North Dakota S...                       1
..                                                ...                     ...
72                                       J. Food Sci.                       1
73           Home Economics Research Report Number 48                       1
74                                 Cereal Foods World                       1
75                        Food Science and Technology                       1
76                                 J. Agric Food Chem                       1

[77 rows x 2 columns]

Second Visualization: **Number of publications per year**

In [44]:
v_2 = pd.read_sql("SELECT year, COUNT(title) as number_of_publications FROM data_src WHERE year is not Null GROUP BY year", conn)

In [45]:
v_2 #Data for visualization 2

    year  number_of_publications
0   1963                       1
1   1994                       8
2   1989                      13
3   1991                      10
4   1996                      11
5   1987                      13
6   1977                       4
7   1971                       3
8   2000                      18
9   1965                       1
10  1956                       1
11  1984                       3
12  1983                       4
13  1985                      11
14  2005                       2
15  1973                       1
16  2003                      11
17  1993                      11
18  1990                      13
19  1998                       4
20  1972                       1
21  1976                       2
22  1953                       1
23  1966                       1
24  1981                       6
25  2002                      27
26  1978                       1
27  1979                       7
28  2004                      17
29  1997                      10
30  1968                       1
31  1980                       7
32  1962                       1
33  2001                      30
34  1999                      44
35  1970                       4
36  1986                      11
37  1982                       9
38  1988                      10
39  1995                      12
40  1964                       1
41  1992                      19

Third Visualization: **Food Group for each food**

In [108]:
v_3 = pd.read_sql("SELECT ndb_no as food_id, shrt_desc, fd.fdgrp_cd as id_group, fddrp_desc as group from food_des as fd, fd_group as fg WHERE fg.fdgrp_cd = fd.fdgrp_cd", conn)

In [109]:
v_3

,food_id,shrt_desc,id_group,group
0,01001,"BUTTER,WITH SALT",0100,Dairy and Egg Products
1,01002,"BUTTER,WHIPPED,WITH SALT",0100,Dairy and Egg Products
2,01003,"BUTTER OIL,ANHYDROUS",0100,Dairy and Egg Products
3,01004,"CHEESE,BLUE",0100,Dairy and Egg Products
4,01005,"CHEESE,BRICK",0100,Dairy and Egg Products
...,...,...,...,...
7141,80200,"FROG LEGS,RAW",1500,Finfish and Shellfish Products
7142,83110,"MACKEREL,SALTED",1500,Finfish and Shellfish Products
7143,90240,"SCALLOP,(BAY&SEA),CKD,STMD",1500,Finfish and Shellfish Products
7144,90560,"SNAIL,RAW",1500,Finfish and Shellfish Products
7145,93600,"TURTLE,GREEN,RAW",1500,Finfish and Shellfish Products